## random module

In [3]:
#resuing old df

In [5]:
import numpy as np
import pandas as pd
from functools import reduce

df = pd.DataFrame({
    "employee": ["Keshav", "Afroze", "Nico", "Sravya", "Ethan", "Fiona"],
    "department": ["HR", "Finance", "IT", "Finance", "IT", "HR"],
    "salary": [500000, 600000, np.nan, 720000, 550000, 580000],
    "joining_date": pd.to_datetime([
        "2020-01-15", "2019-03-10", "2021-06-25", 
        "2018-07-01", "2022-02-14", "2021-11-11"
    ]),
    "bonus": [50000, 7000000, 40000, 80000, np.nan, 60000]
}, index=["E1", "E2", "E3", "E4", "E5", "E6"])

print(df)

   employee department    salary joining_date      bonus
E1   Keshav         HR  500000.0   2020-01-15    50000.0
E2   Afroze    Finance  600000.0   2019-03-10  7000000.0
E3     Nico         IT       NaN   2021-06-25    40000.0
E4   Sravya    Finance  720000.0   2018-07-01    80000.0
E5    Ethan         IT  550000.0   2022-02-14        NaN
E6    Fiona         HR  580000.0   2021-11-11    60000.0

In [7]:
# Pick a random employee from df

In [9]:
df

   employee department    salary joining_date      bonus
E1   Keshav         HR  500000.0   2020-01-15    50000.0
E2   Afroze    Finance  600000.0   2019-03-10  7000000.0
E3     Nico         IT       NaN   2021-06-25    40000.0
E4   Sravya    Finance  720000.0   2018-07-01    80000.0
E5    Ethan         IT  550000.0   2022-02-14        NaN
E6    Fiona         HR  580000.0   2021-11-11    60000.0

In [11]:
import random

In [19]:
random_employee = random.choice(df["employee"])

/Applications/anaconda3/lib/python3.11/random.py:374: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  return seq[self._randbelow(len(seq))]

In [21]:
random_employee

'Sravya'

In [23]:
#  Assign random performance scores between 1 and 10

In [27]:
df["performance"] = [random.randint(1, 10) for score in range(len(df))]

In [29]:
df

   employee department    salary joining_date      bonus  performance
E1   Keshav         HR  500000.0   2020-01-15    50000.0            7
E2   Afroze    Finance  600000.0   2019-03-10  7000000.0            8
E3     Nico         IT       NaN   2021-06-25    40000.0            1
E4   Sravya    Finance  720000.0   2018-07-01    80000.0            7
E5    Ethan         IT  550000.0   2022-02-14        NaN            2
E6    Fiona         HR  580000.0   2021-11-11    60000.0            3

In [31]:
# Shuffle employees (just names here)

In [33]:
shuffled_employees = df["employee"].tolist()

In [35]:
shuffled_employees

['Keshav', 'Afroze', 'Nico', 'Sravya', 'Ethan', 'Fiona']

In [37]:
random.shuffle(shuffled_employees)

In [41]:
shuffled_employees

['Ethan', 'Fiona', 'Sravya', 'Nico', 'Keshav', 'Afroze']

In [43]:
 # Randomly select 2 employees from IT department

In [45]:
it_employees = df.loc[df.department == "IT", "employee"].tolist()

In [47]:
random_it = random.sample(it_employees, 2 if len(it_employees) >= 2 else len(it_employees))

In [49]:
random_it

['Ethan', 'Nico']

## from_records

In [52]:
# New DataFrame from employee, salary, bonus

In [54]:
emp_sal_bonus = pd.DataFrame.from_records(
    df[["employee", "salary", "bonus"]].to_records(index=False)
)

In [56]:
emp_sal_bonus

  employee    salary      bonus
0   Keshav  500000.0    50000.0
1   Afroze  600000.0  7000000.0
2     Nico       NaN    40000.0
3   Sravya  720000.0    80000.0
4    Ethan  550000.0        NaN
5    Fiona  580000.0    60000.0

In [58]:
# Convert df to records and rebuild

In [60]:
records = df.to_records(index=False)

In [64]:
records

rec.array([('Keshav', 'HR', 500000., '2020-01-15T00:00:00.000000000',   50000., 7),
           ('Afroze', 'Finance', 600000., '2019-03-10T00:00:00.000000000', 7000000., 8),
           ('Nico', 'IT',     nan, '2021-06-25T00:00:00.000000000',   40000., 1),
           ('Sravya', 'Finance', 720000., '2018-07-01T00:00:00.000000000',   80000., 7),
           ('Ethan', 'IT', 550000., '2022-02-14T00:00:00.000000000',      nan, 2),
           ('Fiona', 'HR', 580000., '2021-11-11T00:00:00.000000000',   60000., 3)],
          dtype=[('employee', 'O'), ('department', 'O'), ('salary', '<f8'), ('joining_date', '<M8[ns]'), ('bonus', '<f8'), ('performance', '<i8')])

In [62]:
rebuilt_df = pd.DataFrame.from_records(records)

In [66]:
rebuilt_df

  employee department    salary joining_date      bonus  performance
0   Keshav         HR  500000.0   2020-01-15    50000.0            7
1   Afroze    Finance  600000.0   2019-03-10  7000000.0            8
2     Nico         IT       NaN   2021-06-25    40000.0            1
3   Sravya    Finance  720000.0   2018-07-01    80000.0            7
4    Ethan         IT  550000.0   2022-02-14        NaN            2
5    Fiona         HR  580000.0   2021-11-11    60000.0            3

In [68]:
# From list of dictionaries

In [70]:
dict_data = [
    {"name": row.employee, "dept": row.department}
    for row in df.itertuples(index=False)
]

In [72]:
dict_data

[{'name': 'Keshav', 'dept': 'HR'},
 {'name': 'Afroze', 'dept': 'Finance'},
 {'name': 'Nico', 'dept': 'IT'},
 {'name': 'Sravya', 'dept': 'Finance'},
 {'name': 'Ethan', 'dept': 'IT'},
 {'name': 'Fiona', 'dept': 'HR'}]

In [74]:
dict_df = pd.DataFrame.from_records(dict_data)

In [76]:
dict_df

     name     dept
0  Keshav       HR
1  Afroze  Finance
2    Nico       IT
3  Sravya  Finance
4   Ethan       IT
5   Fiona       HR

In [78]:
#  Finance-only DataFrame

In [80]:
finance_records = df[df.department == "Finance"].to_records(index=False)

In [82]:
finance_records

rec.array([('Afroze', 'Finance', 600000., '2019-03-10T00:00:00.000000000', 7000000., 8),
           ('Sravya', 'Finance', 720000., '2018-07-01T00:00:00.000000000',   80000., 7)],
          dtype=[('employee', 'O'), ('department', 'O'), ('salary', '<f8'), ('joining_date', '<M8[ns]'), ('bonus', '<f8'), ('performance', '<i8')])

In [84]:
finance_df = pd.DataFrame.from_records(finance_records)

In [86]:
finance_df

  employee department    salary joining_date      bonus  performance
0   Afroze    Finance  600000.0   2019-03-10  7000000.0            8
1   Sravya    Finance  720000.0   2018-07-01    80000.0            7